TurtleWhal/GWatch-Paris/sdkconfig.defaults
# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- Flash / partitions ---
# Board has 16 MB SPI flash; default IDF partition tables only use 1.5-2 MB.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Performance ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# Larger data cache + 64-byte lines: ~10-20% faster LVGL render on RGB565 buffers.
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
# Quad PSRAM at 80 MHz (IDF default is 40). The LVGL object heap (custom
# lv_malloc), NimBLE buffers, and draw-layer buffers all live in PSRAM, so
# every cache miss on them pays PSRAM latency; 80 MHz doubles that bandwidth.
# Flash already runs 80 MHz on the same MSPI timing domain.
CONFIG_SPIRAM_SPEED_80M=y

# --- USB Serial/JTAG ---
# Hold ESP_PM_NO_LIGHT_SLEEP while host is connected so flashing/monitor stays
# alive — without this, light sleep tears down the USB peripheral and the host
# loses the device a few seconds after plug-in.
CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION=y

# --- LVGL ---
# FreeRTOS-aware OS layer so esp_lvgl_port can drive LVGL from its own task,
# and lvgl_port_lock/unlock works (required for cross-task LVGL mutation).
CONFIG_LV_OS_FREERTOS=y
# 60 Hz refresh (default is 33 ms / 30 Hz). A full frame streams to the panel
# in ~11.5 ms at 80 MHz SPI and rendering pipelines against the DMA via the
# ping-pong buffers, so 16 ms is attainable; scroll/animation smoothness and
# touch-poll latency (indev read period follows this) both double. Frames
# that miss the window just render late — worst case degrades to the old
# 30 Hz, so there's no cliff.
CONFIG_LV_DEF_REFR_PERIOD=16
# 2x uint32 per lv_obj_t to memoize style-property lookups — render and
# layout passes hammer lv_obj_get_style_*. Costs ~8 B x obj count of
# internal SRAM (objs are small mallocs -> SPIRAM_MALLOC_ALWAYSINTERNAL
# keeps them internal). If ble_init ever hits malloc failures at boot
# again, this is a (minor) suspect alongside LV_USE_SNAPSHOT above.
CONFIG_LV_OBJ_STYLE_CACHE=y
# To enable the on-screen FPS overlay, also set CONFIG_LV_USE_SYSMON=y and
# CONFIG_LV_USE_PERF_MONITOR=y via menuconfig (depends on SYSMON).
# lv_snapshot: render an object subtree into a caller-provided draw buffer.
# The weather screen uses it to pre-render itself once per weather update
# into a PSRAM RGB565 buffer, then blits that flat image while scrolling
# instead of re-rasterising its arched text / UV gradient / rotated arrow
# every frame. The snapshot buffer is always allocated in PSRAM (see
# weather.cpp), so this does NOT add to the internal-SRAM pressure that the
# BT controller is sensitive to. (An earlier attempt to enable snapshot
# with an internal-RAM buffer is what caused the ble_init malloc panics
# noted in ble.cpp.) If BLE ever fails to init again, this is a suspect.
CONFIG_LV_USE_SNAPSHOT=y
# Route ALL lv_malloc() allocations to PSRAM. LVGL's default CLIB malloc
# pulled every widget/style/layout allocation from internal SRAM (they're
# small mallocs, and SPIRAM_MALLOC_ALWAYSINTERNAL=1024 forces sub-1KB
# allocs internal), so the built screen tree + a full notification list
# could drive free internal SRAM down to ~3 KB and cause malloc failures.
# CUSTOM malloc lets us back lv_malloc with heap_caps_malloc(MALLOC_CAP_
# SPIRAM) — see main/system/lv_mem_psram.c. The ping-pong DMA draw buffers
# are unaffected: esp_lvgl_port allocates those separately (buff_dma=true),
# not through lv_malloc, so they stay in internal DMA-capable SRAM.
# Route LVGL's object heap into PSRAM via a custom allocator
# (main/system/lv_mem_psram.c). Confirmed root cause of the awake-freeze was
# internal-SRAM exhaustion: boot baseline was ~9 KB free, so a burst of
# notifications ran the render path out of memory and it wedged. Objects on
# PSRAM restore ~30 KB of internal headroom. (The DMA draw buffers stay
# internal — esp_lvgl_port allocates those separately.)
# CONFIG_LV_USE_CLIB_MALLOC is not set
CONFIG_LV_USE_CUSTOM_MALLOC=y

# --- Bluetooth (NimBLE host for Gadgetbridge BLE) ---
# ESP32-S3 is BLE-only; NimBLE is lighter than Bluedroid and the right pick.
# Peripheral + broadcaster only; we never act as central/observer.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# Bigger ATT MTU so notifications don't fragment heavily over NUS.
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=247
# Pin host task to core 0 (LVGL owns core 1).
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y
# BT controller modem sleep: keep BLE link alive across light sleep so the
# watch can pull notifications/time from the phone while the display is off.
#
# Use the main XTAL as the BT sleep clock (BLE spec requires <500 ppm; the
# 136 kHz internal RC blew through that and the link dropped within seconds
# even while the chip was awake). MAIN_XTAL_PU_DURING_LIGHT_SLEEP keeps the
# main crystal powered through light sleep so the BT controller still has
# its clock — small extra current vs. RC, but the link stays alive.
CONFIG_BT_CTRL_MODEM_SLEEP=y
CONFIG_BT_CTRL_MODEM_SLEEP_MODE_1=y
CONFIG_BT_CTRL_LPCLK_SEL_MAIN_XTAL=y
CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP=y

# Drop default TX power from +9 dBm (the IDF default) to 0 dBm. Cuts
# per-event radio current on every advertising and connection slot; for
# a watch-on-wrist + phone-in-pocket pair (≤ 2 m) 0 dBm is plenty of
# link margin. If you ever take this farther from the phone and the
# link starts dropping, bump back up to N3 (-3 dBm) or P3 (+3 dBm).
CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N0=y

# Don't power down the CPU domain during light sleep. Saves ~650 µA but
# the SPI master / esp_lcd state doesn't survive the powerdown — after
# wake the LCD pipeline silently drops every pixel write and the screen
# stays black despite LVGL still running.
# CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP is not set
# Push NimBLE host buffers/queues to PSRAM. Internal SRAM is tight once the
# BT controller (~80 KB, fixed) and WiFi statics also take their share —
# without this, esp_wifi_init returns ESP_ERR_NO_MEM at boot.
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y

# WiFi disabled — Gadgetbridge handles time sync over BLE, so we don't need
# IP networking, and dropping the WiFi stack frees the internal SRAM that
# the BT controller wanted.
# CONFIG_ESP_WIFI_ENABLED is not set
